def caesarCipher(s, k):
    new=''
    for i in s:
        if i.isalpha(): # ถ้า i เป็นตัวอักษร
            if i.islower(): # ถ้า i เป็นตัวอักษรพิมพ์เล็ก
                new+=chr(((ord(i)-ord('a')+k)%26)+ord('a')) # ใช้ ord เพื่อเปลี่ยน i ให้เป็น ascii value เอามาคำนวณ แล้วเอามาเปลี่ยนกลับเป็นตัวอักษร
            elif i.isupper(): # ถ้า i เป็นตัวอักษรพิมพ์ใหญ่
                new+=chr(((ord(i)-ord('A')+k)%26)+ord('A')) # ใช้ ord เพื่อเปลี่ยน i ให้เป็น ascii value เอามาคำนวณ แล้วเอามาเปลี่ยนกลับเป็นตัวอักษร
            #  mod 26 เพราะมี 26 ตัวอักษร และ +ord('a') หรือ +ord('A') เพื่อเอาค่าที่คำนวณได้มาเปลี่ยนกลับให้อยู่ในช่วงตัวอักษรแบบเดิม
        else:
            new+=i # ถ้า i ไม่ใช่ตัวอักษร ให้เพิ่ม i ใน new โดยไม่เปลี่ยนแปลง
    return new
